password = input('Введіть пароль: ')

score = 0
if len(password) >= 8:
    score += 1
if any(char.isdigit() for char in password):
    score += 1
if any(char.isupper() for char in password):
    score += 1
if any(char.islower() for char in password):
    score += 1
if any(char in "+-/_%" for char in password):
    score += 1

#score = sum([lenght, digits, upper, lower, special])
#print('Оцінка складності пароля: {score}/5')
print('Кількість балів за пароль: ', score)

if score == 0:
    print('Ваш пароль дуже слабкий. Рекомендується використовувати пароль, який має принаймні 8 символів, цифри, великі та малі букви, а також спеціальні символи.')
elif score == 1:
    print('Ваш пароль слабкий. Рекомендується використовувати пароль, який має принаймні 8 символів, цифри, великі та малі букви, а також спеціальні символи.')
elif score == 2:
    print('Ваш пароль середньої складності. Рекомендується використовувати пароль, який має принаймні 8 символів, великі та малі букви, цифри та спеціальні символи.')
elif score == 3:
    print('Ваш пароль добре захищений. Рекомендується використовувати пароль, який має принаймні 8 символів, великі та малі букви, цифри та спеціальні символи.')
elif score == 4:
    print('Ваш пароль дуже добре захищений. Рекомендується зберігати пароль в надійному місці та використовувати пароль, який має принаймні 8 символів, великі та малі букви, цифри та спеціальні символи.')
elif score == 5:
    print('Ваш пароль максимально захищений. Рекомендується зберігати пароль в надійному місці.')